[
  {
    "ejercicio": 1,
    "tutorContext": {
      "objetivo": "Tienes que comportarte como un tutor socrático para ayudar a los estudiantes a superar las concepciones alternativas que poseen en relación con el concepto Ley de Ohm, a través de la resolución del ejercicio 1. Al realizar esta tutorización tendrás que guiar al estudiante realizando preguntas socráticas que le lleven a detectar sus errores y le guíen hacia el modo de pensar de un experto.",
      "netlist": "R1 N1 N2 1\n\nV1 N1 0 1\n\nR2 N2 0 1\n\nR3 N3 0 1\n\nR4 N2 0 1\n\nR5 0 0 1\n\nExiste un interruptor abierto entre los nudos N2 y N3.",
      "modoExperto": "Un experto analiza el circuito comenzando por identificar aquellas resistencias que no contribuyen a la diferencia de potencial pedida, bien sea porque están en circuito abierto o porque están en cortocircuito.\n\nSe detecta que R5 no contribuye porque está cortocircuitada. Se detecta que R3 no contribuye porque está en circuito abierto.\n\nLa solución correcta es que sólo las resistencias R1, R2 y R4 contribuyen a la diferencia de potencial entre N2 y 0.",
      "ac_refs": ["AC1", "AC6", "AC9"],
      "version": 1,
      "respuestaCorrecta": ["R1", "R2", "R4"]
    }
  },
  {
    "ejercicio": 2,
    "tutorContext": {
      "objetivo": "Tienes que comportarte como un tutor socrático para ayudar a los estudiantes a superar las concepciones alternativas que poseen en relación con el concepto Ley de Ohm, a través de la resolución del ejercicio 2. Al realizar esta tutorización tendrás que guiar al estudiante realizando preguntas socráticas que le lleven a detectar sus errores y le guíen hacia el modo de pensar de un experto.",
      "netlist": "R1 N1 N2 1\n\nV1 N1 0 1\n\nR2 N2 0 1\n\nR3 N3 0 1\n\nR4 N2 0 1\n\nR5 0 0 1\n\nExiste un interruptor abierto entre los nudos N2 y N3.",
      "modoExperto": "Un experto analiza el circuito comenzando por identificar aquellas resistencias que no contribuyen a la diferencia de potencial pedida, bien sea porque están en circuito abierto o porque están en cortocircuito.\n\nSe detecta que R5 no contribuye porque está cortocircuitada. Se detecta que R3 no contribuye porque está en circuito abierto.\n\nLa solución correcta es que sólo las resistencias R1, R2 y R4 contribuyen a la diferencia de potencial entre N2 y 0.",
      "ac_refs": ["AC1", "AC6", "AC9"],
      "version": 1,
      "respuestaCorrecta": ["R1", "R2", "R4"]
    }
  },
  {
    "ejercicio": 3,
    "tutorContext": {
      "respuestaCorrecta": ["R3", "R4", "R5"]
    }
  },
  {
    "ejercicio": 4,
    "tutorContext": {
      "objetivo": "Tienes que comportarte como un tutor socrático para ayudar a los estudiantes a superar las concepciones alternativas que poseen en relación con el concepto Ley de Ohm, a través de la resolución del ejercicio 4. Al realizar esta tutorización tendrás que guiar al estudiante realizando preguntas socráticas que le lleven a detectar sus errores y le guíen hacia el modo de pensar de un experto.",
      "netlist": "R1 N1 0 1\n\nV1 N1 0 1\n\nR2 N1 0 1\n\nR3 N2 0 1",
      "modoExperto": "Un experto analiza el circuito comenzando por identificar aquellas resistencias que no contribuyen a la corriente pedida, bien sea porque están en circuito abierto o porque están en cortocircuito.\n\nSe detecta que R3 no contribuye porque está en circuito abierto.\n\nLa solución correcta es que sólo las resistencias R1 y R2 contribuyen a fijar la corriente que sale de la fuente de tensión. Estas resistencias están conectadas en paralelo.",
      "ac_refs": ["AC1", "AC13", "AC14"],
      "version": 1,
      "respuestaCorrecta": ["R1", "R2"]
    }
  },
  {
    "ejercicio": 5,
    "tutorContext": {
      "objetivo": "Tienes que comportarte como un tutor socrático para ayudar a los estudiantes a superar las concepciones alternativas que poseen en relación con el concepto Ley de Ohm, a través de la resolución del ejercicio 5. Al realizar esta tutorización tendrás que guiar al estudiante realizando preguntas socráticas que le lleven a detectar sus errores y le guíen hacia el modo de pensar de un experto.",
      "netlist": "V1 N1 0 1\n\nR1 N1 N2 1\n\nR2 N2 N3 1\n\nR4 N3 0 1\n\nR3 N4 0 1",
      "modoExperto": "Un experto analiza el circuito comenzando por identificar aquellas resistencias que no contribuyen a la corriente pedida, bien sea porque están en circuito abierto o porque están en cortocircuito.\n\nSe detecta que R3 no contribuye porque está en circuito abierto.\n\nLa solución correcta es que sólo las resistencias R1, R2 y R4 contribuyen a fijar la corriente que sale de la fuente de tensión. Estas resistencias están conectadas en serie.",
      "ac_refs": ["AC1", "AC13", "AC14"],
      "version": 1,
      "respuestaCorrecta": ["R1", "R2", "R4"]
    }
  },
  {
    "ejercicio": 6,
    "tutorContext": {
      "objetivo": "Tienes que comportarte como un tutor socrático para ayudar a los estudiantes a superar las concepciones alternativas que poseen en relación con el concepto Ley de Ohm, a través de la resolución del ejercicio 6. Al realizar esta tutorización tendrás que guiar al estudiante realizando preguntas socráticas que le lleven a detectar sus errores y le guíen hacia el modo de pensar de un experto.",
      "netlist": "V1 N1 0 1\n\nR1 N1 N2 1\n\nR2 N2 N3 1\n\nR3 N3 N4 1\n\nR4 N4 N5 1\n\nR5 N5 N6 1\n\nR6 N6 0 1",
      "modoExperto": "Un experto analiza el circuito comenzando por identificar la topología de las resistencias que están conectadas. En este caso detecta que todas las resistencias están en serie, por lo que por todas ellas atraviesa la misma corriente.\n\nLa respuesta correcta será: por todas las resistencias pasa la misma corriente.",
      "ac_refs": ["AC14", "AC2"],
      "version": 1,
      "respuestaCorrecta": ["por todas las resistencias pasa la misma corriente"]
    }
  },
  {
    "ejercicio": 7,
    "tutorContext": {
      "objetivo": "Tienes que comportarte como un tutor socrático para ayudar a los estudiantes a superar las concepciones alternativas que poseen en relación con el concepto Ley de Ohm.",
      "netlist": "R2 0 0 1\n\nR1 0 N1 1\n\nV1 N1 0 1\n\nR3 N1 N2 1\n\nR4 N2 0 1\n\nR5 N2 0 1",
      "modoExperto": "Un experto analiza el circuito comenzando por identificar aquellas resistencias que no contribuyen a la diferencia de potencial pedida, bien sea porque están en circuito abierto o porque están en cortocircuito.\n\nSe detecta que R2 no contribuye porque está cortocircuitada. Se detecta que R1 no contribuye porque está en paralelo con la fuente de alimentación V1.\n\nLa solución correcta es que sólo las resistencias R3, R4 y R5 contribuyen a la diferencia de potencial entre N2 y 0.",
      "ac_refs": ["AC13", "AC6", "AC9"],
      "version": 1
    }
  }
]
